# RoomFinishFloor Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RoomFinishFloor Property
ParameterTypeId Class See Also
---
"Floor Finish"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RoomFinishFloor { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RoomFinishFloor As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RoomFinishFloor {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace